{
  "pageType": "multiple",
  "showAllServicesPage": false,
  "title": "Our Pool & Spa Services",
  "subtitle": "",
  "displayType": "images",
  "services": [
    {
      "title": "Window Cleaning",
      "description": "Crystal clear windows inside and out using professional techniques and purified water systems",
      "icon": "droplets",
      "image": "/uploads/service-1758832593765.jpg",
      "slug": "window-cleaning",
      "enabled": true,
      "showOtherServices": true,
      "showThumbnailInHero": false,
      "showContentInHero": false,
      "contentImage": "",
      "longDescription": "Our professional window cleaning service delivers streak-free, crystal clear results using advanced purified water systems and professional-grade squeegees. We clean both interior and exterior surfaces, including screens and sills, ensuring your windows provide the clearest possible view while enhancing your home's curb appeal.",
      "benefits": [
        {
          "title": "Purified Water System",
          "description": "We use advanced water purification technology for spot-free, streak-free results."
        },
        {
          "title": "Interior & Exterior",
          "description": "Complete window cleaning service including screens, sills, and frames."
        },
        {
          "title": "Professional Equipment",
          "description": "Commercial-grade squeegees and tools for superior cleaning results."
        },
        {
          "title": "Satisfaction Guarantee",
          "description": "100% satisfaction guarantee - we'll return if you're not completely happy."
        }
      ]
    },
    {
      "title": "Gutter Cleaning",
      "description": "Professional gutter cleaning and maintenance to protect your home from water damage and foundation issues",
      "icon": "wrench",
      "image": "/uploads/service-1755721787761.jpg",
      "slug": "gutter-cleaning",
      "enabled": true,
      "showOtherServices": true,
      "showThumbnailInHero": false,
      "showContentInHero": false,
      "contentImage": "",
      "longDescription": "Our comprehensive gutter cleaning service removes leaves, debris, and blockages that can cause water damage to your home. We clean gutters, downspouts, and check for proper drainage while inspecting for any damage or maintenance needs. Regular gutter cleaning prevents costly water damage to your foundation, siding, and landscaping.",
      "benefits": [
        {
          "title": "Complete Debris Removal",
          "description": "We remove all leaves, twigs, and debris from gutters and downspouts for optimal water flow."
        },
        {
          "title": "Downspout Cleaning",
          "description": "Thorough cleaning of downspouts to ensure proper drainage away from your foundation."
        },
        {
          "title": "Damage Inspection",
          "description": "We inspect gutters for damage, loose brackets, and proper slope during cleaning."
        },
        {
          "title": "Cleanup Included",
          "description": "Complete cleanup of all debris with proper disposal - your property stays clean."
        }
      ]
    },
    {
      "title": "Pressure Washing",
      "description": "Professional pressure washing to restore curb appeal and protect your property.",
      "icon": "wrench",
      "image": "/uploads/service-1758833007596.png",
      "slug": "pressure-washing",
      "enabled": true,
      "showOtherServices": true,
      "showThumbnailInHero": false,
      "showContentInHero": false,
      "contentImage": "",
      "longDescription": "Over time, dirt, mold, mildew, and grime build up on exterior surfaces, leaving them stained and weathered. Our professional pressure washing service uses high-powered, eco-friendly techniques to safely clean driveways, patios, siding, fences, and more. We remove tough buildup, prevent long-term damage, and restore your property’s original look—boosting both curb appeal and property value.",
      "benefits": [
        {
          "title": "Restore Curb Appeal",
          "description": "Remove years of dirt, stains, and grime to make your property look new again."
        },
        {
          "title": "Protect Surfaces",
          "description": "Gentle yet powerful cleaning prevents damage and extends the life of siding, decks, and concrete."
        },
        {
          "title": "Health & Safety",
          "description": "Eliminate slippery mold, algae, and mildew that can cause slips and health hazards."
        },
        {
          "title": "Boost Property Value",
          "description": "A well-maintained exterior increases home value and leaves a lasting impression."
        }
      ]
    },
    {
      "title": "Painting",
      "description": "Professional exterior painting services that enhance and protect your Wisconsin home with premium-quality finishes",
      "icon": "wrench",
      "image": "https://5.imimg.com/data5/FG/KM/MY-8797479/commercial-painting-services.jpg",
      "slug": "painting",
      "enabled": true,
      "showOtherServices": true,
      "showThumbnailInHero": false,
      "showContentInHero": false,
      "contentImage": "",
      "longDescription": "Our professional exterior painting service transforms your home's appearance while providing lasting protection against Wisconsin's harsh weather conditions. We handle everything from surface preparation to final coat application, ensuring beautiful, long-lasting results. Whether you're refreshing your home's color or preparing a new surface, our experienced team uses premium-grade paints and proven techniques to deliver exceptional quality and durability.",
      "benefits": [
        {
          "title": "Premium Paint Quality",
          "description": "We use only premium, weather-resistant exterior paints specifically formulated to withstand Wisconsin's freeze-thaw cycles and UV exposure."
        },
        {
          "title": "Expert Surface Preparation",
          "description": "Proper preparation is key to lasting results. We thoroughly prepare all surfaces, including power washing, scraping, sanding, and priming as needed."
        },
        {
          "title": "Professional Application",
          "description": "Our skilled painters use professional techniques and equipment to ensure even coverage, clean lines, and a flawless finish that lasts."
        },
        {
          "title": "Color Consultation",
          "description": "Our team helps you choose the perfect color to enhance your home's curb appeal and architectural features with expert design guidance."
        }
      ]
    }
  ],
  "heroCta": {
    "primary": {
      "text": "Get Free Estimate",
      "link": "/contact",
      "enabled": true,
      "color": "accent",
      "textColor": "white"
    },
    "secondary": {
      "text": "Call Now",
      "link": "tel:(512) 359-8746",
      "enabled": false
    }
  }
}