{
  "pageType": "multiple",
  "showAllServicesPage": false,
  "title": "Our Cleaning Services",
  "subtitle": "",
  "displayType": "images",
  "services": [
    {
      "title": "Window Cleaning",
      "description": "Crystal clear windows inside and out using premium techniques",
      "icon": "droplets",
      "image": "/uploads/service-1758832593765.jpg",
      "slug": "window-cleaning",
      "enabled": true,
      "showOtherServices": true,
      "showThumbnailInHero": false,
      "showContentInHero": false,
      "contentImage": "",
      "longDescription": "Our premium window cleaning service delivers streak-free, crystal clear results using advanced purified water systems and professional-grade squeegees. We clean both interior and exterior surfaces, including screens and sills, ensuring your windows provide the clearest possible view while enhancing your home's curb appeal.",
      "benefits": [
        {
          "title": "Purified Water System",
          "description": "We use advanced water purification technology for spot-free, streak-free results."
        },
        {
          "title": "Interior & Exterior",
          "description": "Complete window cleaning service including screens, sills, and frames."
        },
        {
          "title": "Professional Equipment",
          "description": "Commercial-grade squeegees and tools for superior cleaning results."
        },
        {
          "title": "Satisfaction Guarantee",
          "description": "100% satisfaction guarantee - we'll return if you're not completely happy."
        }
      ]
    },
    {
      "title": "Soft Washing",
      "description": "Gentle soft washing for roofs and houses, pressure washing for driveways",
      "icon": "wrench",
      "image": "https://lonestarshineexteriorcleaning.com/uploads/service-1758833007596.png",
      "slug": "soft-washing",
      "enabled": true,
      "showOtherServices": true,
      "showThumbnailInHero": false,
      "showContentInHero": false,
      "contentImage": "",
      "longDescription": "Our comprehensive exterior cleaning service uses the right method for each surface. We use gentle soft washing techniques for roofs, siding, and delicate surfaces to safely remove dirt, mold, algae, and stains without damage. For durable surfaces like driveways, walkways, and patios, we use traditional pressure washing to effectively remove stubborn grime and restore surfaces to like-new condition.",
      "benefits": [
        {
          "title": "Surface-Specific Methods",
          "description": "Gentle soft washing for roofs and siding, effective pressure washing for driveways and walkways - the right technique for every surface."
        },
        {
          "title": "Eco-Friendly Solutions",
          "description": "We use environmentally responsible cleaning solutions that are safe for your family, pets, and landscaping."
        },
        {
          "title": "Protect Your Investment",
          "description": "Soft washing preserves roof shingles and siding while pressure washing restores concrete and stone surfaces without damage."
        },
        {
          "title": "Complete Exterior Care",
          "description": "From delicate roof cleaning to heavy-duty driveway restoration - we handle every aspect of your property's exterior."
        }
      ]
    },
    {
      "title": "Gutter Cleaning",
      "description": "Professional gutter cleaning and maintenance to protect your home",
      "icon": "droplets",
      "image": "https://lonestarshineexteriorcleaning.com/uploads/service-1755721787761.jpg",
      "slug": "gutter-cleaning",
      "enabled": true,
      "showOtherServices": true,
      "showThumbnailInHero": false,
      "showContentInHero": false,
      "contentImage": "",
      "longDescription": "Clean gutters are essential for protecting your home from water damage. Our professional gutter cleaning service removes debris and ensures proper water drainage. We handle everything safely and efficiently, so you don't have to worry about climbing ladders or dealing with leaves and dirt.",
      "benefits": [
        {
          "title": "Debris Removal",
          "description": "Complete removal of leaves, twigs, and other debris that can clog gutters and cause water damage."
        },
        {
          "title": "Safe Service",
          "description": "Professional crews with proper safety equipment - no need for you to tackle this dangerous task."
        },
        {
          "title": "Prevent Water Damage",
          "description": "Properly flowing gutters protect your foundation, basement, and landscape from expensive water damage."
        },
        {
          "title": "Regular Maintenance",
          "description": "Schedule seasonal cleanings to keep your gutters in top condition year-round."
        }
      ]
    },
    {
      "title": "Holiday Lighting",
      "description": "Professional holiday lighting design and installation for a festive home",
      "icon": "award",
      "image": "https://www.outdoorlights.com/sub/45921/images/Fishers-Indiana-Christmas-Lighting-Service.jpeg",
      "slug": "holiday-lighting",
      "enabled": true,
      "showOtherServices": true,
      "showThumbnailInHero": false,
      "showContentInHero": false,
      "contentImage": "",
      "longDescription": "Make your home the highlight of the neighborhood with professional holiday lighting. Our team designs custom lighting displays tailored to your home's architecture and style. We handle all installation, and provide convenient removal when the season ends.",
      "benefits": [
        {
          "title": "Custom Design",
          "description": "We work with you to create a beautiful holiday light display that matches your style and preferences."
        },
        {
          "title": "Professional Installation",
          "description": "Expert installation with high-quality LED lights and commercial-grade wiring for safety and durability."
        },
        {
          "title": "Hassle-Free Service",
          "description": "We handle design, installation, and removal - you just enjoy the beautiful results and compliments from neighbors."
        },
        {
          "title": "Energy Efficient",
          "description": "We use LED lights that are energy-efficient and long-lasting, reducing your electricity costs."
        }
      ]
    }
  ],
  "heroCta": {
    "primary": {
      "text": "Get Free Estimate",
      "link": "/contact",
      "enabled": true,
      "color": "primary",
      "textColor": "white"
    },
    "secondary": {
      "text": "Call Now",
      "link": "tel:(865) 336-0700",
      "enabled": true,
      "color": "white"
    }
  }
}